In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X', 'X','Y','Y', 'Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

dframe

   dataset1  dataset2 k1     k2
0  0.668665 -0.773098  X  alpha
1 -0.587929 -1.243531  X   beta
2  0.767518  1.453099  Y  alpha
3 -0.416435 -0.523511  Y   beta
4  0.452721 -0.443912  Z  alpha

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [4]:
group1.mean()

k1
X    0.040368
Y    0.175542
Z    0.452721
Name: dataset1, dtype: float64

In [5]:
cities = np.array(['NY','LA', 'LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN','FEB', 'JAN'])

In [6]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -0.587929
    JAN    0.767518
NY  FEB   -0.416435
    JAN    0.560693
Name: dataset1, dtype: float64

In [7]:
dframe

   dataset1  dataset2 k1     k2
0  0.668665 -0.773098  X  alpha
1 -0.587929 -1.243531  X   beta
2  0.767518  1.453099  Y  alpha
3 -0.416435 -0.523511  Y   beta
4  0.452721 -0.443912  Z  alpha

In [8]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.040368 -1.008315
Y   0.175542  0.464794
Z   0.452721 -0.443912

In [9]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.668665 -0.773098
   beta  -0.587929 -1.243531
Y  alpha  0.767518  1.453099
   beta  -0.416435 -0.523511
Z  alpha  0.452721 -0.443912

In [10]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [12]:
for name, group in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0  0.668665 -0.773098  X  alpha
1 -0.587929 -1.243531  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  0.767518  1.453099  Y  alpha
3 -0.416435 -0.523511  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4  0.452721 -0.443912  Z  alpha

In [14]:
for (k1,k2), group in dframe.groupby(['k1', 'k2']):
    print("Key1 = %s Key2 = %s" %(k1,k2))
    print(group)
    print('\n')

Key1 = X Key2 = alpha
   dataset1  dataset2 k1     k2
0  0.668665 -0.773098  X  alpha


Key1 = X Key2 = beta
   dataset1  dataset2 k1    k2
1 -0.587929 -1.243531  X  beta


Key1 = Y Key2 = alpha
   dataset1  dataset2 k1     k2
2  0.767518  1.453099  Y  alpha


Key1 = Y Key2 = beta
   dataset1  dataset2 k1    k2
3 -0.416435 -0.523511  Y  beta


Key1 = Z Key2 = alpha
   dataset1  dataset2 k1     k2
4  0.452721 -0.443912  Z  alpha

In [15]:
dframe

   dataset1  dataset2 k1     k2
0  0.668665 -0.773098  X  alpha
1 -0.587929 -1.243531  X   beta
2  0.767518  1.453099  Y  alpha
3 -0.416435 -0.523511  Y   beta
4  0.452721 -0.443912  Z  alpha

In [16]:
group_dict = dict(list(dframe.groupby('k1')))

In [17]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.668665 -0.773098  X  alpha
1 -0.587929 -1.243531  X   beta

In [18]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [19]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.668665 -0.773098
 1 -0.587929 -1.243531
 2  0.767518  1.453099
 3 -0.416435 -0.523511
 4  0.452721 -0.443912, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [20]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]

In [21]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.773098
   beta  -1.243531
Y  alpha  1.453099
   beta  -0.523511
Z  alpha -0.443912